---
kind: property
id: P:Autodesk.Revit.DB.MEPSystem.HasPlaceholders
zh: 系统
source: html/e89c9b10-e8d5-5cda-5190-94ac03b704fe.htm
---
# Autodesk.Revit.DB.MEPSystem.HasPlaceholders Property

**中文**: 系统

Indicates if the system has one or more placeholders.

## Syntax (C#)
```csharp
public bool HasPlaceholders { get; }
```